''''''
'''
算数运算符：
    +
    -
    *
    /
    %：求余，
    //：整除，向下整除，返回整数类型
    **：幂运算，前为底数，后为指数，如：2**3=2*2*2=8

闰年：
    普通闰年：公历年份是4的倍数，且不是100的倍数的，为闰年（如2004年、2020年等就是闰年）。
    世纪闰年：公历年份是整百数的，必须是400的倍数才是闰年（如1900年不是闰年，2000年是闰年）

逻辑运算符：
    and：与
        语法表示：x and y
        口诀：真真为真
    or：或
        语法表示：x or y
        口诀：假假为假
    not：非
        语法表示：not x
        口诀：真为假，假为真


'''

'''练习1'''
# print('3 + 2 =',3+2)
# print('3 - 2 =',3-2)
# print('3 * 2 =',3*2)
# print('3 / 2 =',3/2)
# print('3 // 2 =',3//2)
# print('3 % 2 =',3%2)
# print('3 ** 2 =',3**2)






'''练习2'''
# a=input('请输入长方体的长：')
# b=input('请输入长方体的宽：')
# c=input('请输入长方体的高：')
# v=float(a)*float(b)*float(c)
# print('长方体的体积为：',v)






'''练习3：双分支嵌套'''
# y=int(input('请输入年份'))
# if y%100==0:
#     if y%400==0:
#         print(y,'年是世纪闰年',sep='')
#     else:
#         print(y, '年是平年', sep='')
# else:
#     if y%4==0:
#         print(y, '年是普通闰年', sep='')
#     else:
#         print(y, '年是平年', sep='')





'''练习4：多分支嵌套'''
# y=int(input('请输入年份'))
# if y%400==0:
#     print(y,'年是世纪闰年',sep='')
# elif y%100!=0:
#     if y%4==0:
#         print(y, '年是普通闰年', sep='')
#     else:
#         print(y, '年是平年', sep='')
# else:
#     print(y, '年是平年', sep='')






'''逻辑运算符'''
# print(3>=3)
# print(3>=3 and 3>2)
# print(3>=3 and 3>12)
# print(3>=3 or 3>12)
# print(3>=13 or 3>12)
# print(not(3>12))






'''练习5：逻辑运算符'''
# y=int(input('请输入年份'))
# if y%400==0:
#     print(y,'年是世纪闰年',sep='')
# elif y%100!=0 and y%4==0:
#     print(y, '年是普通闰年', sep='')
# else:
#     print(y, '年是平年', sep='')






'''-----------------------------------------------------------------------------------------------------------------------------'''


























