''''''
'''
#：注释
    作用：提示人们下面代码的功能，计算机不执行这句话
    
print(内容)：打印

必须有引号：中文、字母、符号
    单引号和双引号都可以

input(提示语)：用来接收键盘输入内容的方法

=：赋值
    后面的内容给前面

变量：
    用来存放数据的容器，任何类型的数据都可以进行存放和取用
    每个变量都需要一个变量名
    变量的创建需要使用到赋值符号“=”，如：变量名=XXX
    变量名的取名不可与python内置关键字冲突，如：and、class
    
变量名的命名规则：
    由数字、_、字母、中文组成（通常不用中文）
    不能以数字开头
    不能是关键字
    
练习题：
    B
    B
    A   B    

'''

'''项目'''
# a1=input('输入姓名：')
# a2=input('输入爱好：')
# a3=input('输入未来的目标：')
# print('姓名：')
# print(a1)
# print('爱好：')
# print(a2)
# print('未来的目标：')
# print(a3)






'''---------------------------------------------------------------------------------------------------------------------------------------'''


























































































































