''''''
'''
分支结构：
    单分支：
        语法格式：
            if 条件判断:
                条件为真
            条件为假
    双分支：
        语法格式：
            if 条件判断:
                条件为真
            else:
                条件为假
    多分支:
        语法格式：
            if 条件判断1:
                条件1为真
            elif 条件判断2:
                条件2为真
            elif 条件判断3:
                条件3为真 
            ......   
            else:
                以上条件都为假
        elif可以有无数个
    
缩进：表示层次关系，由四个空格或一个Tab键

a==b：判断a与b是否相等或相同
    ==：是比较运算符
    =：是赋值运算符
        
a in b：a是否存在b中
    in：是成员运算符
    
条件：有真或假可以当条件

练习题：
    B
    A 
    B

'''

'''练习1'''
# message=input('请输入内容：')
# print(message)






'''项目'''
# name='菲菲'
# age=10
# aihao='聊天'
# hello='你好，嗨，在吗，哈喽'
# message=input('对菲菲说：')
# if message in hello:
#     print(name+'说：嗨我是'+name)
# elif message == '你多大了呀':
#     print(name,'说：我',age,'岁了',sep='')
# elif message == '你喜欢做什么':
#     print(name,'说：我喜欢',aihao,sep='')
# else:
#     print(name,'说：哎呀，你说什么？',sep='')






'''---------------------------------------------------------------------------------------------------------------------------------------------'''










































